<script setup >
import AnimatedAccordion from "@/component/animated/animated-accordion.vue";

const faqHome = [
    {
        title: "Как мне найти подходящий курс?",
        text: "Наша платформа служит связующим звеном между студентами и наставниками, предлагая разнообразные онлайн-курсы с индивидуальным наставничеством. Вы можете просмотреть наш каталог курсов, изучить профили наставников и найти идеальный вариант, соответствующий вашим целям и предпочтениям в обучении.",
        active: false,
    },
    {
        title: "В чем преимущества обучения с наставниками онлайн?",
        text: "Обучение с наставниками обеспечивает индивидуальное руководство и поддержку с учетом ваших потребностей. Наша платформа связывает вас с опытными наставниками, которые стремятся помочь вам добиться успеха, предлагая ценные идеи, отзывы и поддержку на протяжении всего вашего учебного пути.",
        active: false,
    },
    {
        title: "Как я могу связаться со своим наставником?",
        text: "Вы можете связаться со своим наставником через систему обмена сообщениями на нашей платформе. Если у вас есть вопросы, вам нужны рекомендации или вы хотите обсудить свои цели обучения, наша платформа обеспечивает удобную и безопасную среду для общения и сотрудничества с вашим наставником.",
        active: false,
    },
    {
        title: "Какую пользу приносит студентам система CRM?",
        text: "Наша CRM-система повышает эффективность обучения, обеспечивая бесперебойную связь и сотрудничество с наставником. В ней централизованно хранятся материалы курса, задания и обратная связь, что позволяет вам быть организованным, отслеживать свой прогресс и эффективно взаимодействовать с наставником.",
        active: false,
    },
    {
        title: "Что делать, если мне нужен гибкий график обучения?",
        text: "Наша платформа предлагает гибкие варианты обучения, позволяя вам заниматься в удобном для вас темпе. Вы можете получать доступ к материалам курса, общаться с наставником и выполнять задания из любого места и в любое время, что позволяет совмещать учебу с другими делами.",
        active: false,
    }
]
const faqsPartners = [
    {
        title: "Как я могу стать ментором на вашей платформе?",
        text: "Стать наставником на нашей платформе очень просто. Вы можете зарегистрироваться в качестве партнера, создать свой профиль и продемонстрировать свой опыт и стиль преподавания. Наша платформа поможет вам связаться со студентами, которые ищут наставников в вашей области, что упростит процесс обмена знаниями и опытом с другими.",
        active: false,
    },
    {
        title: "Какие функции предлагает ваша CRM-система для наставников?",
        text: "Наша CRM-система позволяет наставникам эффективно управлять своей преподавательской деятельностью и взаимодействовать со студентами. Она предоставляет инструменты для организации материалов курса, отслеживания прогресса студентов и передачи обратной связи, позволяя наставникам проводить индивидуальные и эффективные занятия с преподавателями.",
        active: false,
    },
    {
        title: "Как я могу поддержать студентов в достижении их целей?",
        text: "Ваша роль как наставника заключается в том, чтобы направлять и вдохновлять студентов на их учебном пути. Наша платформа облегчает связь между наставниками и студентами, позволяя вам предлагать индивидуальную помощь, делиться ценными знаниями и помогать студентам в достижении их академических и профессиональных целей.",
        active: false,
    },
    {
        title: "Гибко ли преподавание на вашей платформе?",
        text: "Да, преподавание на нашей платформе обеспечивает гибкость в плане расписания, разработки учебных программ и подхода к обучению. У вас есть возможность самостоятельно устанавливать график, адаптировать содержание курса в соответствии с потребностями студентов и общаться с ними удаленно, что гарантирует полезный и насыщенный опыт преподавания.",
        active: false,
    },
    {
        title: "Каковы преимущества сотрудничества с вашей платформой?",
        text: "Сотрудничество с нами дает наставникам доступ к разнообразному сообществу студентов, передовым инструментам CRM и маркетинговой поддержке для развития их наставнического бизнеса. Наша платформа упрощает процесс соединения наставников и студентов, позволяя вам сосредоточиться на том, что у вас получается лучше всего: направлять и вдохновлять других на успех.",
        active: false,
    }
]

</script>

<template>
    <main class="bg-accent container mx-auto rounded-xl shadow mb-8 py-8">
        <div class="w-full  mx-auto px-4 md:px-6 ">

            <h1 class="text-2xl font-bold text-slate-900 mb-4">FAQs</h1>

            <div class="flex flex-row flex-wrap w-full items-baseline justify-between">
                <template v-for="(faq, index) in faqHome">
                    <animated-accordion class="w-5/12 py-2 px-4 border-b-2 border-b-base-100" :title="faq.title" :id="`faqs-${index}`" :active="faq.active">
                        {{ faq.text }}
                    </animated-accordion>
                </template>
            </div>

        </div>
    </main>
</template>
